Revit 2026 API

# DuctSettingsRectangularDuctSizeSeparator Property

---

The rectangular duct size separator string.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string RectangularDuctSizeSeparator { get; set; }
```
```vb
Public Property RectangularDuctSizeSeparator As String
	Get
	Set
```
```cpp
public:
property String^ RectangularDuctSizeSeparator {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member RectangularDuctSizeSeparator : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

DuctSettings Class

Autodesk.Revit.DB.Mechanical Namespace